; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v7 ?v4)
             (pred_6 ?v11 ?v2)
             (pred_7 ?v7 ?v2)
             (pred_1 ?v6 ?v7 )
	     (pred_11 ?v7)
             (pred_12 ?v5)
             (pred_10 ?v11)
             (pred_5 ?v2)
             (pred_8 ?v7)
             (pred_2 ?v11)
             (pred_4 ?v7)
             (pred_3 ))



(:action op_1
:parameters (?v8 ?v13 ?v1 ?v9)
:precondition (and (pred_12 ?v8) (pred_12 ?v13) (pred_10 ?v1) (pred_5 ?v9)
          (pred_9 ?v8 ?v13) (pred_6 ?v1 ?v9)
                   (pred_7 ?v13 ?v9) (pred_11 ?v8) 
                   (pred_8 ?v13) (pred_2 ?v1))
:effect (and  (pred_4 ?v13) (not (pred_8 ?v13))))


(:action op_2
:parameters (?v8 ?v12)
:precondition (and (pred_12 ?v8) (pred_12 ?v12)
               (pred_11 ?v8) (pred_9 ?v8 ?v12) (pred_4 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v8))))

(:action op_5
:parameters (?v8 ?v1)
:precondition (and (pred_12 ?v8) (pred_10 ?v1) 
                  (pred_11 ?v8) (pred_1 ?v1 ?v8) (pred_3 ))
:effect (and (pred_2 ?v1)
   (not (pred_1 ?v1 ?v8)) (not (pred_3 ))))


(:action op_3
:parameters (?v8 ?v10 ?v3)
:precondition (and (pred_12 ?v8) (pred_10 ?v10) (pred_10 ?v3)
                  (pred_11 ?v8) (pred_2 ?v3) (pred_1 ?v10 ?v8))
:effect (and (pred_2 ?v10) (pred_1 ?v3 ?v8)
        (not (pred_2 ?v3)) (not (pred_1 ?v10 ?v8))))

(:action op_4
:parameters (?v8 ?v1)
:precondition (and (pred_12 ?v8) (pred_10 ?v1) 
                  (pred_11 ?v8) (pred_2 ?v1))
:effect (and (pred_3 ) (pred_1 ?v1 ?v8) (not (pred_2 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_02 obj_06 obj_20 obj_14 obj_27 obj_09 obj_11 obj_28 obj_30 obj_10 obj_31 obj_13 obj_18 obj_23 obj_03 obj_22 obj_26 obj_29 obj_05 obj_25 obj_04 obj_01 obj_16 obj_15 obj_19
    obj_17 obj_08 obj_24
    obj_07 obj_12 obj_32 obj_21
    )

    (:init
       (pred_3)

       (pred_12 obj_02)
       (pred_12 obj_06)
       (pred_12 obj_20)
       (pred_12 obj_14)
       (pred_12 obj_27)
       (pred_12 obj_09)
       (pred_12 obj_11)
       (pred_12 obj_28)
       (pred_12 obj_30)
       (pred_12 obj_10)
       (pred_12 obj_31)
       (pred_12 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_23)
       (pred_12 obj_03)
       (pred_12 obj_22)
       (pred_12 obj_26)
       (pred_12 obj_29)
       (pred_12 obj_05)
       (pred_12 obj_25)
       (pred_12 obj_04)
       (pred_12 obj_01)
       (pred_12 obj_16)
       (pred_12 obj_15)
       (pred_12 obj_19)
       (pred_5 obj_17)
       (pred_5 obj_08)
       (pred_5 obj_24)
       (pred_10 obj_07)
       (pred_10 obj_12)
       (pred_10 obj_32)
       (pred_10 obj_21)

       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_06)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_06 obj_02)
       (pred_9 obj_20 obj_28)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_14 obj_30)
       (pred_9 obj_14 obj_27)
       (pred_9 obj_14 obj_20)
       (pred_9 obj_27 obj_10)
       (pred_9 obj_27 obj_14)
       (pred_9 obj_09 obj_31)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_11 obj_28)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_28 obj_18)
       (pred_9 obj_28 obj_30)
       (pred_9 obj_28 obj_20)
       (pred_9 obj_28 obj_11)
       (pred_9 obj_30 obj_23)
       (pred_9 obj_30 obj_10)
       (pred_9 obj_30 obj_14)
       (pred_9 obj_30 obj_28)
       (pred_9 obj_10 obj_03)
       (pred_9 obj_10 obj_27)
       (pred_9 obj_10 obj_30)
       (pred_9 obj_31 obj_22)
       (pred_9 obj_31 obj_13)
       (pred_9 obj_31 obj_09)
       (pred_9 obj_13 obj_26)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_13 obj_11)
       (pred_9 obj_13 obj_31)
       (pred_9 obj_18 obj_29)
       (pred_9 obj_18 obj_23)
       (pred_9 obj_18 obj_28)
       (pred_9 obj_18 obj_13)
       (pred_9 obj_23 obj_05)
       (pred_9 obj_23 obj_03)
       (pred_9 obj_23 obj_30)
       (pred_9 obj_23 obj_18)
       (pred_9 obj_03 obj_25)
       (pred_9 obj_03 obj_10)
       (pred_9 obj_03 obj_23)
       (pred_9 obj_22 obj_04)
       (pred_9 obj_22 obj_26)
       (pred_9 obj_22 obj_31)
       (pred_9 obj_26 obj_01)
       (pred_9 obj_26 obj_29)
       (pred_9 obj_26 obj_13)
       (pred_9 obj_26 obj_22)
       (pred_9 obj_29 obj_16)
       (pred_9 obj_29 obj_05)
       (pred_9 obj_29 obj_18)
       (pred_9 obj_29 obj_26)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_05 obj_25)
       (pred_9 obj_05 obj_23)
       (pred_9 obj_05 obj_29)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_25 obj_03)
       (pred_9 obj_25 obj_05)
       (pred_9 obj_04 obj_01)
       (pred_9 obj_04 obj_22)
       (pred_9 obj_01 obj_16)
       (pred_9 obj_01 obj_26)
       (pred_9 obj_01 obj_04)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_16 obj_29)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_15 obj_19)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_19 obj_15)
       (pred_8 obj_06)
       (pred_8 obj_28)
       (pred_8 obj_09)
       (pred_8 obj_15)
       (pred_7  obj_06 obj_17)
       (pred_7  obj_28 obj_08)
       (pred_7  obj_09 obj_24)
       (pred_7  obj_15 obj_24)
       (pred_4 obj_02)
       (pred_4 obj_20)
       (pred_4 obj_14)
       (pred_4 obj_27)
       (pred_4 obj_11)
       (pred_4 obj_30)
       (pred_4 obj_10)
       (pred_4 obj_31)
       (pred_4 obj_13)
       (pred_4 obj_18)
       (pred_4 obj_23)
       (pred_4 obj_03)
       (pred_4 obj_22)
       (pred_4 obj_26)
       (pred_4 obj_29)
       (pred_4 obj_05)
       (pred_4 obj_25)
       (pred_4 obj_04)
       (pred_4 obj_01)
       (pred_4 obj_16)
       (pred_4 obj_19)

       (pred_6  obj_07 obj_17)
       (pred_6  obj_12 obj_08)
       (pred_6  obj_32 obj_24)
       (pred_6  obj_21 obj_24)
       (pred_1 obj_07 obj_20)
       (pred_1 obj_12 obj_14)
       (pred_1 obj_32 obj_29)
       (pred_1 obj_21 obj_16)
       (pred_11 obj_13)
    )

    (:goal (and
       (pred_1 obj_07 obj_31)
       (pred_1 obj_12 obj_01)
       (pred_1 obj_32 obj_10)
    ))
(:constraints
  (always (not (pred_11 obj_30)))
)
)

; plan
1. (op_2 obj_13 obj_18)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_18)
   goals met: 0 of 3
2. (op_2 obj_18 obj_29)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_29)
   goals met: 0 of 3
3. (op_5 obj_29 obj_32)
   deleted: (pred_1 obj_32 obj_29) (pred_3)
   added: (pred_2 obj_32)
   goals met: 0 of 3
4. (op_2 obj_29 obj_18)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_18)
   goals met: 0 of 3
5. (op_2 obj_18 obj_23)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_23)
   goals met: 0 of 3
6. (op_2 obj_23 obj_03)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_03)
   goals met: 0 of 3
7. (op_2 obj_03 obj_10)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_10)
   goals met: 0 of 3
8. (op_4 obj_10 obj_32)
   deleted: (pred_2 obj_32)
   added: (pred_3) (pred_1 obj_32 obj_10)
   goals met: 1 of 3
9. (op_2 obj_10 obj_27)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_27)
   goals met: 1 of 3
10. (op_2 obj_27 obj_14)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_14)
   goals met: 1 of 3
11. (op_5 obj_14 obj_12)
   deleted: (pred_1 obj_12 obj_14) (pred_3)
   added: (pred_2 obj_12)
   goals met: 1 of 3
12. (op_2 obj_14 obj_20)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_20)
   goals met: 1 of 3
13. (op_1 obj_20 obj_28 obj_12 obj_08)
   deleted: (pred_8 obj_28)
   added: (pred_4 obj_28)
   goals met: 1 of 3
14. (op_2 obj_20 obj_28)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_28)
   goals met: 1 of 3
15. (op_4 obj_28 obj_12)
   deleted: (pred_2 obj_12)
   added: (pred_3) (pred_1 obj_12 obj_28)
   goals met: 1 of 3
16. (op_2 obj_28 obj_20)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_20)
   goals met: 1 of 3
17. (op_5 obj_20 obj_07)
   deleted: (pred_1 obj_07 obj_20) (pred_3)
   added: (pred_2 obj_07)
   goals met: 1 of 3
18. (op_2 obj_20 obj_28)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_28)
   goals met: 1 of 3
19. (op_2 obj_28 obj_11)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_11)
   goals met: 1 of 3
20. (op_2 obj_11 obj_13)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_13)
   goals met: 1 of 3
21. (op_2 obj_13 obj_31)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_31)
   goals met: 1 of 3
22. (op_4 obj_31 obj_07)
   deleted: (pred_2 obj_07)
   added: (pred_3) (pred_1 obj_07 obj_31)
   goals met: 2 of 3
23. (op_2 obj_31 obj_13)
   deleted: (pred_11 obj_31)
   added: (pred_11 obj_13)
   goals met: 2 of 3
24. (op_2 obj_13 obj_11)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_11)
   goals met: 2 of 3
25. (op_2 obj_11 obj_28)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_28)
   goals met: 2 of 3
26. (op_5 obj_28 obj_12)
   deleted: (pred_1 obj_12 obj_28) (pred_3)
   added: (pred_2 obj_12)
   goals met: 2 of 3
27. (op_2 obj_28 obj_11)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_11)
   goals met: 2 of 3
28. (op_2 obj_11 obj_13)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_13)
   goals met: 2 of 3
29. (op_2 obj_13 obj_26)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_26)
   goals met: 2 of 3
30. (op_2 obj_26 obj_01)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_01)
   goals met: 2 of 3
31. (op_4 obj_01 obj_12)
   deleted: (pred_2 obj_12)
   added: (pred_3) (pred_1 obj_12 obj_01)
   goals met: 3 of 3
